Revit 2027 API
AnnotationSymbol.GetLeaders Method
 Returns a collection of leaders currently attached to the annotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Leader> GetLeaders()
Public Function GetLeaders As IList(Of Leader)
public:
IList<Leader^>^ GetLeaders()
member GetLeaders : unit -> IList<Leader>
Return Value
IList<Leader>
Remarks
 This method supersedes an older Leaders property which has been deprecated.
See Also
Reference
AnnotationSymbol Class
Autodesk.Revit.DB Namespace